Repository: ShiZhan/tech-trans-en-zh
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: It made a lot of sense for the authors, because they could compute what they needed and be done with it.
zh_cn: 就作者而言这还是挺有意义，因为他们可以完成他们需要的计算。

source: It seems that most graph processing systems are looking for similar sorts of interfaces that make graph processing easy, and high performance possible.
zh_cn: 似乎大多数的图处理系统正在寻找一种相似的使图处理易用，且高性能的接口。

source: It's less helpful if you still need to do one of those tasks of Semih's up above.
zh_cn: 如果你仍需要执行上述 Semih 那些处理任务之一，这个方案就不太有用。

source: It’s based on the idea that it’s easier to remember important, like a sunset over the Grand Canyon, than the last time you waited for a traffic light.
zh_cn: 其基于这样一个想法，就是越重要的事情越容易记住，比方说在大峡谷上的日落，之于上一次等红灯。

source: It’s clear that the big iron arrays are sucking wind – EMC’s VMAX/VNX (Information Storage) group saw peak sales in Q4, 2014 – and I forecast that declining trend will accelerate in coming quarters and last for years.
zh_cn: 毫无疑问大块头阵列正处于风口浪尖 — — EMC 的 VMAX/VNX （信息存储） 团队在2014 年第 4 季度达至销售高峰 — — 我预测其下降趋势在未来几个季度将加快并持续多年。

source: It’s like driving down the highway in second gear, there is potential to move a lot faster!!!
zh_cn: 这就像在高速公路上用二档开车，原本有着跑得更快的潜力!!!

source: It’s possible that this could be another hype round, but I don't think so.
zh_cn: 这可能是另一个回合炒作，但我不这么认为。

source: I’m also pleased – probably unjustifiably – by the notion that however smart Ais become, they won’t be perfect.
zh_cn: 这观点让我开心 – 虽然有些不太合适 – 无论人工智能将变得如何聪明，其仍无法完美。

source: I’m curious about the system architecture running the Gödel Machine and the I/O workload the machine generates.
zh_cn: 我很好奇哥德尔机运行的系统体系结构及其生成的 I/O 工作负载。

source: Just as any software problem can be solved by adding a layer of indirection, any analytics problem can be solved by adding a layer of intelligence.
zh_cn: 如同任何软件问题都可以通过增加一个间接层来解决一样，任何一项分析问题也可以通过补充一个智能层来处理。

source: Just look at some of the amazing ideas people have built recently:
zh_cn: 来看一些人们最近建立起的惊人想法︰

source: Just understanding what system calls are made from all of the applications from strace tells you only part of the story, as it does not provide an understanding of what is happening on the storage level.
zh_cn: 用 strace 来了解应用程序执行着哪些系统调用只不过是故事的一部分，因为这不能让人理解在存储层面上发生着什么。

source: Let's be clear, all the research to be published in 2016 has already been done and written by this point.
zh_cn: 我们应该清楚，所有要在 2016 年发表的研究成果必须已经完成，而且已经写好。

source: Let's talk about that now.
zh_cn: 我们现在谈谈这个问题。

source: Let’s start at the device and work our way up the stack.
zh_cn: 让我们从设备一侧开始，工作我们沿着堆栈向上进行分析。

source: Looking for a version that runs on your mac?
zh_cn: 想找个可以在你的 mac 电脑上运行的版本吗？

source: Modern CPU and memory systems may reorder stores to memory to improve performance, breaking consistency in case of system failure.
zh_cn: 当代 CPU 与主存系统常将重组数据存储于主存以改善性能，系统出现故障时一致性将被破坏。

source: More importantly, I expect that several NVM types will be coming to market over the next 5 years.
zh_cn: 更为重要的是，我期待着在未来5年里有几种类型的 NVM 能够进入市场。

source: Most controllers were designed with significantly more front-end bandwidth with the assumption that much of the data accessed would reside in cache.
zh_cn: 大多数的控制器在设计上给前端带宽很大的余量，这是基于大部分数据访问将集中在缓存中的假设。

source: NOVA adapts conventional log-structured file system techniques to exploit the fast random access that NVMs provide.
zh_cn: NOVA 采用常规的日志文件系统技术，以发挥 NVM 提供的高速随机访问优势。

source: Neural networks are all the rage in AI, but there is a newer technology – Gödel machines – that is now a standard part of the AI toolset.
zh_cn: 神经网络在人工智能领域正广受关注，然而还有新技术 — — 哥德尔机 — — 现在也成为 AI 工具集的一个标准部分。

source: No.
zh_cn: 不。

source: Nonetheless, the IBM team is doing important work.
zh_cn: 然而，IBM 团队正做着做重要的工作。

source: Now we get to the hard part of the equation.
zh_cn: 现在我们来到这个问题中困难的部分。

source: Of course this is not only true for storage but also true for the computational side, as faster CPUs and more cores do not always translate into more work.
zh_cn: 当然不仅对于存储如此，计算方面也一样，速度更快的 CPU 和更多内核不总是会转化为完成更多的工作。

source: Of course, we know a lot more about indirection than we do intelligence.
zh_cn: 无疑，相比于智能，我们更理解间接。

source: Often times you would need to rebuild or convert your model to work on different architectures.
zh_cn: 而且重制或者转换模型以运行于不同系统结构这种情况也挺常有。

source: On top of that, we will see many new platforms made specifically for TensorFlow.
zh_cn: 以此为基础，我们将会看到更多用 TensorFlow 创作的新平台。

source: Or how about a version that runs on your cell phone, it might not exist.
zh_cn: 或一款可在你的手机上运行的版本，它可能不存在。

source: People are ≈70% of enterprise data center cost.
zh_cn: 人力资源 ≈70% 企业数据中心开销。

source: Photo courtesy of Shutterstock.
zh_cn: 照片由 Shutterstock 提供。

source: Placing a much-faster-than-flash-but-slower-and-cheaper-than-DRAM NVM on the processor's memory bus makes perfect sense.
zh_cn: 将显著快过闪存且稍慢、稍便宜于 DRAM 的 NVM 放置在处理器的主存总线上更有意义。

source: Platforms
zh_cn: 平台

source: Posted April 21, 2016 By Paul Rubens http://www.enterprisestorageforum.com/storage-technology/does-3d-xpoint-spell-the-end-for-flash-storage-1.html
zh_cn: 发布 2016 年 4 月 21 日 由 Paul Rubens http://www.enterprisestorageforum.com/storage-technology/does-3d-xpoint-spell-the-end-for-flash-storage-1.html

source: Posted March 17, 2016 By Henry Newman http://www.enterprisestorageforum.com/storage-hardware/why-workloads-matter-more-than-iops-or-streaming.html
zh_cn: 发布于 2016 年 3 月 17 日 由亨利 · 纽曼 http://www.enterprisestorageforum.com/storage-hardware/why-workloads-matter-more-than-iops-or-streaming.html

source: Presumably the original assumption was that folks would use breadth-first graph traversal, which exercised the memory subsystem in the way the benchmark authors intended (a mix of bulk memory access and pointer chasing).
zh_cn: 是初的假设大概是，人们会使用广度优先遍历图，由此内存子系统访问将按照基准测试作者的意图 （大块内存访问和指针追逐的混合） 的方式进行。

source: Providing strong consistency guarantees is particularly challenging for memory-based file systems because maintaining data consistency in NVMM can be costly.
zh_cn: 提供强一致性保证就基于内存的文件系统而言颇具挑战性，因为在 NVMM 中维护数据一致性代价不菲。

source: Rather, they are representative of algorithms that can be expressed in the lowest-common-denominator systems.
zh_cn: 相反，他们是代表着最低共性特征的算法。

source: Remember label propagation for connected components?
zh_cn: 还记得联通子图所用的标签传播吗？

source: Research in machine learning has had all these roadblocks that create fragmentation and slow down progress.
zh_cn: 在机器学习的研究之中，有着这许多路障，使得过程碎片化并因此减缓。

source: Scale.
zh_cn: 扩展。

source: Searcher.
zh_cn: 搜索者。

source: Semih Salihoglu and Jennifer Widom have [a paper in VLDB](http://ilpubs.stanford.edu:8090/1077/3/p535-salihoglu.pdf) detailing what they had to do to get non-trivial graph algorithms working well in a Pregel-like system.
zh_cn: Semih Salihoglu 和 Jennifer Widom 发飙了 [一篇 VLDB 论文](http://ilpubs.stanford.edu:8090/1077/3/p535-salihoglu.pdf) 详细介绍了他们如何使非简易图算法在 Pregel 类型系统中良好运行。

source: Simpler storage = fewer and cheaper people.
zh_cn: 简单存储 = 更少的人手需求，更低的人力资源成本

source: So enabling machine intelligence to trash data is probably the most essential issue and value of cognitive storage – and the capability most likely to frighten users.
zh_cn: 启用机器智能来舍弃数据可能是认知存储最基本的问题和价值所在 — — 也是最有可能让用户害怕的能力。

source: So just knowing what your application does is not everything; you need to try and understand what the storage system is doing with your application and you also need to know what else is running on the system at the same time, which is a far more complicated task.
zh_cn: 所以只知道你的应用程序做了什么还不够; 你需要试着去了解与你的应用程序相应的存储系统做了什么，甚至还需要知道与此同时在系统上还运行着别的什么，这项任务更为复杂。

source: So many papers confuse graph "problems" and graph "algorithms".
zh_cn: 很多论文混淆图"问题"和图"算法"。

source: So what does impact workload throughput for storage systems?
zh_cn: 所以是什么在影响存储系统的工作负载吞吐量？

source: Solver.
zh_cn: 求解器。

source: Some are forecasting that we’ll be generating more data than we’ll have capacity to store once IoT gets rolling.
zh_cn: 已有预测指出，一旦物联网广泛运用，我们产生的数据将超过我们所拥有的存储容量.

source: Some well-known ones:
zh_cn: 这些比较有名：

source: Sounds workable!
zh_cn: 听起来可行！

source: Storage costs continue to fall faster than computational costs, creating a difficult economic dynamic for cognitive storage.
zh_cn: 相比计算成本，存储成本持续下降更快，也因此给认知存储造成一种困难的经济环境。

source: StorageMojo has often asked buyers to focus on latency rather than IOPS thanks to SSDs making IOPS cheap and plentiful.
zh_cn: 感谢固态盘让 IOPS 既便宜又充裕，StorageMojo 经常提醒购买者关注延迟而非 IOPS。

source: Sure, you can schlep unlikely-to-be-needed data off to low cost tape – IBM is a leading tape drive vendor – but the “store everything forever” algorithm doesn’t scale – and if something won’t scale forever, it won’t.
zh_cn: 当然，你能将不太可能被用到的数据转移进低成本磁带上— — IBM 是领先的磁带驱动器供应商 — — 但"永远存储一切"算法无法扩展 — — 只要有什么不能持续扩展，那就不会。

source: TensorFlow is open source software for creating machine learning models, especially deep neural networks.
zh_cn: TensorFlow 是一款开放源码软件，用于创建机器学习模型，尤其深度神经网络。

source: That is amazing, consider it has only been out a few months!
zh_cn: 那很惊人，要知道这才过了几个月 ！

source: That is my view of the main issue with graph processing research at the moment, but it shows up a few different ways.
zh_cn: 这是我认为此刻在图处理研究中存在的主要问题，也揭示出一些不同的途径。

source: That, in a nutshell, is why systems won’t be able to advantage of NVM technology until their DRAM and disk I/O stacks are re-engineered for the specific advantages and quirks of NVM. The paper offers a smart way to adapt existing techniques to the brave new world of NVM. From the paper: ...
zh_cn: 那么，归纳起来，这也就是为什么除非将 DRAM 与磁盘 I/O 栈针对 NVM 的特殊优势与问题进行重新设计，系统将不可能发挥出 NVM 技术的先进性。这篇论文提供了一种聪明的方法来将现有技术适配到 NVM 的全新领域中。 文中还提到: ...

source: That’s what’s motivating the secular trend for simpler storage.
zh_cn: 这就是简单存储这个长期趋势的幕后推手。

source: That’s why data scientists are in high demand.
zh_cn: 这就是为何数据科学家面临急需。

source: The *problem* of undirected graph connectivity is to identify connected components, whereas the *algorithm* of label propagation is a specific approach based on repeatedly circulating the smallest known node identifiers.
zh_cn: 无向图联通性 *问题* 是为找出联通子图，在这里这种标签传播 *算法* 是一种基于反复散布最小已知节点标记的特殊方法。

source: The Gödel Machine is a universal problem solver encoded as a completely self-referential program capable of rewriting any part of itself, provided it can prove that the rewrite is useful according to some utility function, encoded within itself.
zh_cn: 哥德尔机是一种通用问题求解器，其被编码为完全自引用程序，能够改写自身任一部分，通过一些实用函数，在其内进行自编码，可以证明重写用途。

source: The Gödel Machine was invented by Jürgen Schmidhuber in 2003.
zh_cn: 哥德尔机由 Jürgen Schmidhuber 在 2003 年发明。

source: The IT equivalent of Formula 1 race tuning won’t disappear: some apps will always require the utmost performance.
zh_cn: IT 领域里如同 F1 方程式比赛一样的调优还不会消失︰ 总有一些应用需要极致的性能。

source: The MSST conference is going to have a number of talks that will explore the ins and outs of various workloads and how those workloads impact various storage systems.
zh_cn: 在 MSST 会议上将有大量的报告，将探讨各种工作负载和这些工作负载如何影响各种存储系统的来龙去脉。

source: The NVMW is a production of UCSD’s Non-Volatile Research Lab and the Center for Memory Recording Research.
zh_cn: 非易失存储器研讨会 NVMW 是由加州大学圣迭戈分校 UCSD 的非易失研究实验室与存储记录研究中心主办的。

source: The StorageMojo take
zh_cn: StorageMojo 评论

source: The StorageMojo take The full paper is a must-read for anyone professionally concerned with integrating new NVM technologies into systems.
zh_cn: StorageMojo 评述 这篇论文对那些将 NVM 技术向系统进行整合有专业性考虑的人士而言是必读之作。

source: The StorageMojo take This is StorageMojo, not AIMojo.
zh_cn: StorageMojo 体会 这里是 StorageMojo，不是 AIMojo。

source: The [XStream paper](http://infoscience.epfl.ch/record/188535/files/paper.pdf) continues this specialization a bit more to an edge-centric Gather-Scatter interface, which allows the authors even greater flexibility in system implementation by further restricting the programming API.
zh_cn: [XStream 论文] (http://infoscience.epfl.ch/record/188535/files/paper.pdf) 继续这种专门方法，推进一步构成一种以边为中心的聚散接口，由此通过进一步限制编程 API 给予算法作者在系统实现上更大的灵活性。

source: The advanced remote monitoring and sophisticated but easy to use DR features from Nimble are another example.
zh_cn: Nimble 公司的 DR 功能是另一个例子，其提供先进的远程监控能力，虽然复杂精巧但易于使用。

source: The answer is no, of course, and the same applies for CPU performance.
zh_cn: 答案是不，当然，这同样适用于 CPU 的性能。

source: The benchmark requires one to compute the breadth-first distances and labels for a class of random graphs, and report the elapsed time.
zh_cn: 这项基准测试需要在随机图上计算广度优先遍历的距离和标签，然后报告所用时间。

source: The class of graph algorithms modern systems typically express is quite limited, and as [we've seen before](https://github.com/frankmcsherry/blog/blob/master/posts/2015-01-15.md), many modern graph processors don't outperform a laptop on their intended computations.
zh_cn: 现代系统通常表达的这类图论算法实际上有相当局限性 [我们以前见过] (https://github.com/frankmcsherry/blog/blob/master/posts/2015-01-15.md)，在其专属计算任务上，许多现代图形处理器甚至还不比笔记本电脑更强。

source: The combination of ease of development, ease of deployment, a great interface, backing by google, and all open sourced will push more of the community towards publishing their research on TensorFlow.
zh_cn: 由 Google 所支持，将易于开发、易于部署、伟大的界面相结合，而且还是完全开源的软件，将进一步推动社区使用 TensorFlow 来开展研究。

source: The connectivity to the storage system must take into account both the workflow and how that workflow impacts the underlying design of the storage system.
zh_cn: 连接到存储系统时，必须考虑工作流，以及这个工作流会如何影响其下存储系统的设计。

source: The converged and hyper converged platforms roll storage management in with systems management.
zh_cn: 聚合和超融合的平台将存储管理和系统管理集中在了一起。

source: The driver.
zh_cn: 驱动力。

source: The event attracts researchers from all over the world to present their work and make academic and commercial connections.
zh_cn: 这个会议吸引了来自全世界的研究人员介绍他们的成果，建立起学术界与商业界之间的联系。

source: The goal is balanced systems, and the key to having a balanced system is understanding your workload from end to end.
zh_cn: 目标在于平衡的系统，而构成平衡系统的关键在于从端到端理解你的工作负载。

source: The greater the mutual information, the more valuable the data and, hence, the higher the level of protection, access, and so on.
zh_cn: 互信息越大，就意味着数据更有价值，因此，就需要越高的保护级别，访问控制，等等。

source: The hyperscale guys have the incentive and the resources to perform deep analysis on new technologies.
zh_cn: 那些高杆们具备动机与资源来深入分析新技术。

source: The implication of the former is that since at least one improvement cannot be proved by the searcher, the AI will remain less than optimal.
zh_cn: 前者的引申含义是，因为至少一个改进不能通过搜索者证明，人工智能将仍然弱于最优。

source: The issue with crap algorithms is when they become benchmark computations for research areas.
zh_cn: 在没用算法成为研究领域计算性能评估的基准时，这就成为了问题。

source: The key is using machine learning to determine data value.
zh_cn: 其关键在于使用机器学习来确定数据价值。

source: The key word there is “assumption,” and when the data did not reside in cache, some vendors’ performance was pretty bad.
zh_cn: 这里的关键词是"假设，"，如果数据不驻留于缓存，一些供应商的产品性能就很糟糕。

source: The limits of AI As Gödel proved, any formal system that includes arithmetic, either allows for unprovable but true statements, or is flawed.
zh_cn: 人工智能的极限 正如哥德尔(Gödel)所证明的，任何形式系统，包括算术，或者包含无法证明的永真命题，或者不完备。

source: The losers are the systems that make customers pay for features they no longer need.
zh_cn: 失败的系统是让用户为他们不再需要的功能买单的那些。

source: The main theme at this year’s Mass Storage Systems and Technology Conference (MSST) will be the importance of workflow over bandwidth or IOPs.
zh_cn: 在今年的海量存储系统和技术会议 （MSST）主要主题中，工作流的重要性将盖过带宽或 IOPs。

source: The other issue – beyond the scope of the paper – is also scale-related: how large will the storage system need to be to justify the cost and overhead of cognition?
zh_cn: 另一个问题 — — 超出论文主题 — — 也与规模相关︰ 存储系统要多大才足以给出认知所需成本和开销的充分理由？

source: The paper assumes, correctly, that the big win for new NVM technologies will be as an adjunct to DRAM, rather than as flash SSD replacements – despite the fact that the first Xpoint product will be an Optane SSD.
zh_cn: 论文提出，正确的做法是，将新型 NVM 技术附加于 DRAM，而非用作闪存或者替换固态盘 – 尽管首款 Xpoint 产品仍是 Optane 固态盘。

source: The paper was presented at the Non-Volatile Memory Workshop last week at UCSD.
zh_cn: 这篇论文上周发表于 UCSD 召开的非易失存储器研讨会。

source: The point is that vendors have long designed hardware based on workflow, but it does not mean that all of this was obvious to everyone ten years ago.
zh_cn: 事实上厂商很早就基于工作流设计硬件，但这并不意味着，所有这一切在十年前众所周知。

source: The programming model introduced by Pregel was "think like a vertex", meaning: write a small program that could be run repeatedly by each graph vertex.
zh_cn: 由 Pregel 提出的编程模型即 "如同一个顶点一样思考"，含义︰ 写一个可以在每个顶点上重复运行的小程序。

source: The programs are delightfully simple for the tasks they considered; what's not to like?
zh_cn: 能简洁完成任务让这类程序受人喜欢；那有什么方面不受喜欢？

source: The question is whether faster storage systems always mean faster workload throughput.
zh_cn: 问题是，是否更快的存储系统总是意味着更快的工作负载吞吐量。

source: The research in graph processing systems has (to my reading) largely focused on these problems as their core evaluation metrics, and consequently worked primarily to improve their performance on these problems.
zh_cn: 在图处理系统方向上的研究仍 （就我的阅读而言） 主要集中在以这些问题作为其核心的评价指标，也因此主要是为了提高他们在这些问题上的表现。

source: The researchers use a learning algorithm known as the “Information Bottleneck” (IB)
zh_cn: 研究人员使用了一项被称作“信息瓶颈 (Information Bottleneck, IB)”的学习算法

source: The results were very surprising for the customer and showed the potential for a significant improvement in workflow.
zh_cn: 试验结果令人非常吃惊，显示出在工作流中存在为客户做出重大改进的潜力。

source: The rise of data aware storage from Qumulo and Data Gravity makes it much simpler for less skilled staff to identify storage issues.
zh_cn: 数据感知存储公司 Qumulo 和 Data Gravity 的崛起，使得即便是不太熟练的工作人员也能处理存储相关问题。

source: The same goes for the hacker community.
zh_cn: 黑客社区也是一样。

source: The searcher seeks to improve the entire Gödel machine in a provably – subject to Gödel’s limits of provability, of course – optimal way.
zh_cn: 搜索者旨在从整体上以可证明最优的方式改善哥德尔机 — — 针对哥德尔受到的可证明性限制。

source: The software-only, commodity-based vendors whose products partly compete with cloud, also get it: Scale Computing’s first word on their website is “Simple”.
zh_cn: 就只做软件，且基于常规架构的供应商而言，其产品与云构成部分竞争， 也有这样的认识︰ 扩展计算的第一个词是 "简单"。

source: The solver interacts with some environment and determines utility using a reward function embedded in the machine.
zh_cn: 求解器与一些环境进行交互，并使用机器内嵌的奖励函数来确定效用。

source: The take-away is that they occasionally need to break out of vertex-centric computation into a centralized computation model.
zh_cn: 要点在于他们偶尔需要跳出顶点中心计算模型而改为使用集中计算模型。

source: The trade-off analysis has to become more nuanced than the IOPS/endurance/latency discussions we have today.
zh_cn: 这个如何协调的分析比起我们现在讨论的 IOPS/endurance/latency 这些更为细致。

source: Their numbers wills shrink as the complexity that makes them necessary declines.
zh_cn: 他们的数量将随着使他们成为必须的复杂性一起持续萎缩。

source: There are already multiple companies (in stealth) who are building platforms to easily manage and deploy TensorFlow applications.
zh_cn: 已有多家公司 （悄悄地） 构建能够轻松地管理和部署 TensorFlow 应用程序的平台。

source: There have been 2 AI winters, periods of extreme hype regarding artificial intelligence followed by disappointment and funding cuts.
zh_cn: 历史上曾有过两次人工智能的冬季，那是关于人工智能的极端炒作时期，失望和经费削减随之而来。

source: There have been sporadic attempts over the decades to add intelligence to storage systems, and they’ve all come to grief because the cost of the intelligence was higher than the cost of additional storage.
zh_cn: 几十年来已有零星尝试将智能性添加到存储系统，然而由于其成本高过直接追加存储所以并不成功。

source: There may be an upper limit to how far deep learning technology will go, but as far as we know, we are nowhere near the plateau.
zh_cn: 深度学习技术能走多远，也许有其上限，但就我们所知，我们还远未爬上高原。

source: There were already many deep learning libraries before TensorFlow.
zh_cn: 在 TensorFlow 之前已经有不少深度学习程序库。

source: There will be an explosion of machine learning projects coming out from the hacker community.
zh_cn: 在黑客社区里，正将迎来一场机器学习项目的爆炸。

source: These algorithms are not representative of graph processing problems.
zh_cn: 这些算法不是图形处理问题的代表。

source: These platforms will only act to accelerate ubiquitous machine intelligence.
zh_cn: 这些平台将会加速无处不在机器智能。

source: These systems seem to be optimizing the implementation of known algorithms, and then describing their APIs as the pluggable bits of their systems.
zh_cn: 看起来这些系统是为一些已知算法提供优化实现，然后将其封装为 API 便于在系统中灵活组装。

source: These three algorithms (and minor variations) are ubiquitous because they are easy.
zh_cn: 这些三种算法 （和一些小变体） 是无处不在因为他们很容易。

source: They consist of two main parts:
zh_cn: 它们由两个主要部分组成 ︰

source: This algorithm came to popularity when folks were forced to use Hadoop, because writing sophisticated algorithims in Hadoop is really painful.
zh_cn: 当人们被迫使用 Hadoop 之时，这种算法就被普及，因为在 Hadoop 上编写精致复杂算法真的很棘手。

source: This algorithm, however, is pretty crap.
zh_cn: 而这种算法，是漂亮的垃圾。

source: This is especially true if SSDs are mixed in with standard hard drives.
zh_cn: 尤其是在固态盘与标准磁盘混合使用时更是如此。

source: This is not to say that we can go back to 3 MB/sec disk drives that spin at 3600 RPM, but I am saying that workload throughput should count more than being able to do 1M IOPS or stream data at 600 MB/sec.
zh_cn: 当然这也不是说我们就要回去用 3 MB/秒 及 3600 RPM 转速的磁盘驱动器，我是指比起具备 1M IOPS 或者 600MB/秒 流式数据访问能力而言，工作负载吞吐量更有必要关注。

source: This is totally great if you want to do something like pagerank or breadth-first search; there is a bunch of boiler plate you don't have to rewrite each time.
zh_cn: 如果你想要做如 pagerank 或广度优先搜索这类事，这个方案很棒，不必每次重写一大摞程序组件。

source: This naturally leads to a focus on I/O stack latency, which multiple vendors are attacking.
zh_cn: 这自然导致 I/O 堆栈延迟深受关注，也由此招致多个供应商的攻击 。

source: This of course needs to be abstracted to the volume manager and RAID layout, so it won’t be sequential on a disk drive unless the RAID layout is RAID-1, but there are still potential gotchas such as remapped sectors and virtual allocations.
zh_cn: 这当然需要通过卷管理器和 RAID 布局抽象层，所以它不会在磁盘驱动器上依然保持连续，除非 RAID 布局是 RAID 1，即便如此仍然有潜在可能存在重新映射和虚拟分配。

source: This problem has many solutions developed over the years with a variety of interesting trade-offs.
zh_cn: 多年来就这个问题已开发出很多解决方案，有着各种有趣的权衡取舍。

source: This section is a bit of a rant.
zh_cn: 这一节是有点咆哮。

source: To compensate, the file system needs to explicitly flush data from the CPU’s caches to enforce orderings, adding significant overhead and squandering the improved performance that NVMM can provide.
zh_cn: 相应的，文件系统就需要显式的将数据从 CPU 缓存中刷回以强制重组数据，造成显著开销、浪费 NVMM 本可提供的性能提升。

source: Today most storage enclosures use 12 Gbit/sec SAS for internal communications, so each lane processes ~1.2 GB/sec, given protocol overhead.
zh_cn: 今天大多数存储机柜使用 12 Gb/秒 SAS 内部通信，所以每个通道 ~1.2 GB/秒，此即协议开销。

source: Touted by Intel and Micron as the first new memory tier to be launched since the introduction of NAND flash memory in 1989, its launch could have a significant effect on the storage market and your purchasing decisions.
zh_cn: 英特尔和镁光声称这是自1989 年引入 NAND 快闪存储器以来推出的首个新存储器层次，其面市将可能显著影响存储市场和你的购买决定。

source: Trading expressivity for manageabality can be a false economy.
zh_cn: 用可管理性来换取表达性恐怕是个经济错误。

source: Tuning HDD-based arrays for performance took a lot of knobs and dials – and people who understood them.
zh_cn: 调节磁盘阵列的性能有着复杂的细节 – 还需要熟悉他们的人。

source: Understanding its limits with respect to the foundation of any digital civilization – storage – is critical to our cultural infrastructure.
zh_cn: 以任意数字文化为基础来理解其限制 — — 存储 — — 对我们文化的基础设施至关重要。

source: Understanding what is happening with a single host is difficult, but as storage systems scale out with file systems and object systems that support hundreds if not thousands of client devices and applications, it gets really complex.
zh_cn: 理解单个主机之中发生了什么已很困难，但当存储系统与文件系统以及对象系统向外扩展直至支持上百个，不敢说是数以千计的客户端设备和应用程序时，问题将会非常复杂。

source: Unfortunately, it caught on.
zh_cn: 不幸的是，问题上钩啰。

source: We are already breaking milestones almost every day in artificial intelligence thanks to deep learning.
zh_cn: 感谢深度学习，我们几乎每一天都在人工智能方向上突破一个又一个里程碑。

source: We are also seeing a trend play out in a variety of product categories.
zh_cn: 我们从从一大波产品类别中观察到这个趋势正在涌现。

source: We are living in exciting times.
zh_cn: 我们生活在一个激动人心的时代。
